tutorials/stressAnalysis/icoFsiFoam/flappingConsoleSmall/fluid/system/tetFemSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          tetFemSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    motionU
    {
        solver           CG;
        preconditioner   Cholesky;

        tolerance        1e-06;
        relTol           0;
    }
}


// ************************************************************************* //
